/*
 * 
 * Case A 1.ถ้าหากเคยเชื่อมต่ออินเตอร์ได้แล้ว  
 *        2.ต่อมาอินเตอร์เน็ตไม่ทำงาน 
 *        3.เครื่องจะทำการคอยเชื่อมต่ออินเตอร์เน็ตอัติโนมัติ รอจนกว่าอินเตอร์จะกลับมาทำงานปกติ
 * 
 * 
 * 
 * Case B 1. ถ้าหากเคยเชื่อมต่ออินเตอร์เน็ตได้แล้ว 
 *        2. ต่อมา กด Reset ที่ Hardware
 *        3. โดยที่อินเตอร์ยังทำงานปกติ 
 *        4. เครื่องจะทำการเชื่อมต่ออินเตอร์เน็ตอัติโนมัติ
 * 
 * 
 * Case C 1. ถ้าหากเคยเชื่อมต่ออินเตอร์เน็ตได้แล้ว 
 *        2. ต่อมา กด Reset ที่ Hardware
 *        3. โดยที่อินเตอร์เน็ตหยุดทำงาน 
 *        4. เครื่องจะเข้าสู่โหลด AP เป็นระยะเวลาตามที่กำหนดไว้ และ โดยที่ user ไม่ได้ Connect AP 
 *          4.1 ถ้าครบเวลาแล้ว 
 *              4.1.1 อินเตอร์เน็ตทำงานปกติ เครื่องจะทำการเชื่อมต่ออัติโนมัติ
 *              4.1.2 อินเตอร์เน็ตยังไม่ทำงาน เครื่องจะเข้าสู่โหมด AP ต่อไปเรื่อยๆ
 *              
 *                 
 * Case D 1. ถ้าหากเคยเชื่อมต่ออินเตอร์เน็ตได้แล้ว 
 *        2. ต่อมา กด Reset ที่ Hardware
 *        3. โดยที่อินเตอร์เน็ตหยุดทำงาน 
 *        4. เครื่องจะเข้าสู่โหลด AP เป็นระยะเวลาตามที่กำหนดไว้ และ user Connect AP หรือเข้าหน้า Web Config
 *        5. รอจนกว่า User จะทำรายการเสร็จ หรือ กด Save ก่อน เครื่องจึงเริ่มทำการตรวจเช็คอินเตอร์เน็ตอีกครั้ง
 * 
 * 
 * 
 * 
 * Case E 1. Connect Ap 
 *        2. เข้าสู่หน้าเว็บ Config
 *        3. กดปุ่ม Reset ที่หน้าเว็บ
 *           3.1 เครื่องจะทำการ Restart 1 ครั้งแล้ว ทำการตรวจเช็คอินเตอร์อีกครั้ง
 *
 * 
 */
